yvkonkov91/Microcontrolers-arm/stm8/Project/lib/lib3/inc/iostm8al3l89.h
#define TIM1_SMCR_SMS            TIM1_SMCR_bit.SMS
#define TIM1_SMCR_OCCS           TIM1_SMCR_bit.OCCS
#define TIM1_SMCR_TS             TIM1_SMCR_bit.TS
#define TIM1_SMCR_MSM            TIM1_SMCR_bit.MSM

#define TIM1_ETR_ETF             TIM1_ETR_bit.ETF
#define TIM1_ETR_ETPS            TIM1_ETR_bit.ETPS
#define TIM1_ETR_ECE             TIM1_ETR_bit.ECE
#define TIM1_ETR_ETP             TIM1_ETR_bit.ETP

#define TIM1_DER_UDE             TIM1_DER_bit.UDE
#define TIM1_DER_CC1DE           TIM1_DER_bit.CC1DE
#define TIM1_DER_CC2DE           TIM1_DER_bit.CC2DE
#define TIM1_DER_CC3DE           TIM1_DER_bit.CC3DE
#define TIM1_DER_CC4DE           TIM1_DER_bit.CC4DE
#define TIM1_DER_COMDE           TIM1_DER_bit.COMDE

#define TIM1_IER_UIE             TIM1_IER_bit.UIE
#define TIM1_IER_CC1IE           TIM1_IER_bit.CC1IE
#define TIM1_IER_CC2IE           TIM1_IER_bit.CC2IE
#define TIM1_IER_CC3IE           TIM1_IER_bit.CC3IE
#define TIM1_IER_CC4IE           TIM1_IER_bit.CC4IE
#define TIM1_IER_COMIE           TIM1_IER_bit.COMIE
#define TIM1_IER_TIE             TIM1_IER_bit.TIE
#define TIM1_IER_BIE             TIM1_IER_bit.BIE

#define TIM1_SR1_UIF             TIM1_SR1_bit.UIF
#define TIM1_SR1_CC1IF           TIM1_SR1_bit.CC1IF
#define TIM1_SR1_CC2IF           TIM1_SR1_bit.CC2IF
#define TIM1_SR1_CC3IF           TIM1_SR1_bit.CC3IF
#define TIM1_SR1_CC4IF           TIM1_SR1_bit.CC4IF
#define TIM1_SR1_COMIF           TIM1_SR1_bit.COMIF
#define TIM1_SR1_TIF             TIM1_SR1_bit.TIF
#define TIM1_SR1_BIF             TIM1_SR1_bit.BIF

#define TIM1_SR2_CC1OF           TIM1_SR2_bit.CC1OF
#define TIM1_SR2_CC2OF           TIM1_SR2_bit.CC2OF
#define TIM1_SR2_CC3OF           TIM1_SR2_bit.CC3OF
#define TIM1_SR2_CC4OF           TIM1_SR2_bit.CC4OF

#define TIM1_EGR_UG              TIM1_EGR_bit.UG
#define TIM1_EGR_CC1G            TIM1_EGR_bit.CC1G
#define TIM1_EGR_CC2G            TIM1_EGR_bit.CC2G
#define TIM1_EGR_CC3G            TIM1_EGR_bit.CC3G
#define TIM1_EGR_CC4G            TIM1_EGR_bit.CC4G
#define TIM1_EGR_COMG            TIM1_EGR_bit.COMG
#define TIM1_EGR_TG              TIM1_EGR_bit.TG
#define TIM1_EGR_BG              TIM1_EGR_bit.BG

#define TIM1_CCMR1_CC1S          TIM1_CCMR1_bit.CC1S
#define TIM1_CCMR1_OC1FE         TIM1_CCMR1_bit.OC1FE
#define TIM1_CCMR1_OC1PE         TIM1_CCMR1_bit.OC1PE
#define TIM1_CCMR1_OC1M          TIM1_CCMR1_bit.OC1M
#define TIM1_CCMR1_OC1CE         TIM1_CCMR1_bit.OC1CE

#define TIM1_CCMR2_CC2S          TIM1_CCMR2_bit.CC2S
#define TIM1_CCMR2_OC2FE         TIM1_CCMR2_bit.OC2FE
#define TIM1_CCMR2_OC2PE         TIM1_CCMR2_bit.OC2PE
#define TIM1_CCMR2_OC2M          TIM1_CCMR2_bit.OC2M
#define TIM1_CCMR2_OC2CE         TIM1_CCMR2_bit.OC2CE

#define TIM1_CCMR3_CC3S          TIM1_CCMR3_bit.CC3S
#define TIM1_CCMR3_OC3FE         TIM1_CCMR3_bit.OC3FE
#define TIM1_CCMR3_OC3PE         TIM1_CCMR3_bit.OC3PE
#define TIM1_CCMR3_OC3M          TIM1_CCMR3_bit.OC3M
#define TIM1_CCMR3_OC3CE         TIM1_CCMR3_bit.OC3CE

#define TIM1_CCMR4_CC4S          TIM1_CCMR4_bit.CC4S
#define TIM1_CCMR4_OC4PE         TIM1_CCMR4_bit.OC4PE
#define TIM1_CCMR4_OC4M          TIM1_CCMR4_bit.OC4M
#define TIM1_CCMR4_OC4CE         TIM1_CCMR4_bit.OC4CE

#define TIM1_CCER1_CC1E          TIM1_CCER1_bit.CC1E
#define TIM1_CCER1_CC1P          TIM1_CCER1_bit.CC1P
#define TIM1_CCER1_CC1NE         TIM1_CCER1_bit.CC1NE
#define TIM1_CCER1_CC1NP         TIM1_CCER1_bit.CC1NP
#define TIM1_CCER1_CC2E          TIM1_CCER1_bit.CC2E
#define TIM1_CCER1_CC2P          TIM1_CCER1_bit.CC2P
#define TIM1_CCER1_CC2NE         TIM1_CCER1_bit.CC2NE
#define TIM1_CCER1_CC2NP         TIM1_CCER1_bit.CC2NP

#define TIM1_CCER2_CC3E          TIM1_CCER2_bit.CC3E
#define TIM1_CCER2_CC3P          TIM1_CCER2_bit.CC3P
#define TIM1_CCER2_CC3NE         TIM1_CCER2_bit.CC3NE
#define TIM1_CCER2_CC3NP         TIM1_CCER2_bit.CC3NP
#define TIM1_CCER2_CC4E          TIM1_CCER2_bit.CC4E
#define TIM1_CCER2_CC4P          TIM1_CCER2_bit.CC4P

#define TIM1_CNTRH_CNT8          TIM1_CNTRH_bit.CNT8
#define TIM1_CNTRH_CNT9          TIM1_CNTRH_bit.CNT9
#define TIM1_CNTRH_CNT10         TIM1_CNTRH_bit.CNT10
#define TIM1_CNTRH_CNT11         TIM1_CNTRH_bit.CNT11
#define TIM1_CNTRH_CNT12         TIM1_CNTRH_bit.CNT12
#define TIM1_CNTRH_CNT13         TIM1_CNTRH_bit.CNT13
#define TIM1_CNTRH_CNT14         TIM1_CNTRH_bit.CNT14
#define TIM1_CNTRH_CNT15         TIM1_CNTRH_bit.CNT15

#define TIM1_CNTRL_CNT0          TIM1_CNTRL_bit.CNT0
#define TIM1_CNTRL_CNT1          TIM1_CNTRL_bit.CNT1
#define TIM1_CNTRL_CNT2          TIM1_CNTRL_bit.CNT2
#define TIM1_CNTRL_CNT3          TIM1_CNTRL_bit.CNT3
#define TIM1_CNTRL_CNT4          TIM1_CNTRL_bit.CNT4
#define TIM1_CNTRL_CNT5          TIM1_CNTRL_bit.CNT5
#define TIM1_CNTRL_CNT6          TIM1_CNTRL_bit.CNT6
#define TIM1_CNTRL_CNT7          TIM1_CNTRL_bit.CNT7

#define TIM1_PSCRH_PSC8          TIM1_PSCRH_bit.PSC8
#define TIM1_PSCRH_PSC9          TIM1_PSCRH_bit.PSC9
#define TIM1_PSCRH_PSC10         TIM1_PSCRH_bit.PSC10
#define TIM1_PSCRH_PSC11         TIM1_PSCRH_bit.PSC11
#define TIM1_PSCRH_PSC12         TIM1_PSCRH_bit.PSC12
#define TIM1_PSCRH_PSC13         TIM1_PSCRH_bit.PSC13
#define TIM1_PSCRH_PSC14         TIM1_PSCRH_bit.PSC14
#define TIM1_PSCRH_PSC15         TIM1_PSCRH_bit.PSC15

#define TIM1_PSCRL_PSC0          TIM1_PSCRL_bit.PSC0
#define TIM1_PSCRL_PSC1          TIM1_PSCRL_bit.PSC1
#define TIM1_PSCRL_PSC2          TIM1_PSCRL_bit.PSC2
#define TIM1_PSCRL_PSC3          TIM1_PSCRL_bit.PSC3
#define TIM1_PSCRL_PSC4          TIM1_PSCRL_bit.PSC4
#define TIM1_PSCRL_PSC5          TIM1_PSCRL_bit.PSC5
#define TIM1_PSCRL_PSC6          TIM1_PSCRL_bit.PSC6
#define TIM1_PSCRL_PSC7          TIM1_PSCRL_bit.PSC7

#define TIM1_ARRH_ARR8           TIM1_ARRH_bit.ARR8
#define TIM1_ARRH_ARR9           TIM1_ARRH_bit.ARR9
#define TIM1_ARRH_ARR10          TIM1_ARRH_bit.ARR10
#define TIM1_ARRH_ARR11          TIM1_ARRH_bit.ARR11
#define TIM1_ARRH_ARR12          TIM1_ARRH_bit.ARR12
#define TIM1_ARRH_ARR13          TIM1_ARRH_bit.ARR13
#define TIM1_ARRH_ARR14          TIM1_ARRH_bit.ARR14
#define TIM1_ARRH_ARR15          TIM1_ARRH_bit.ARR15

#define TIM1_ARRL_ARR0           TIM1_ARRL_bit.ARR0
#define TIM1_ARRL_ARR1           TIM1_ARRL_bit.ARR1
#define TIM1_ARRL_ARR2           TIM1_ARRL_bit.ARR2
#define TIM1_ARRL_ARR3           TIM1_ARRL_bit.ARR3
#define TIM1_ARRL_ARR4           TIM1_ARRL_bit.ARR4
#define TIM1_ARRL_ARR5           TIM1_ARRL_bit.ARR5
#define TIM1_ARRL_ARR6           TIM1_ARRL_bit.ARR6
#define TIM1_ARRL_ARR7           TIM1_ARRL_bit.ARR7

